jeongwhanchoi/ARM-CortexM3-Examples/Huins_NXP_LPC1768_Library/Drivers/include/LPC1768_Huins.h
/******************************************************************************
  * @file  LPC1768_Huins.h
  * @author  Huins Embbeded Team  by HyunKH
  * @version V1.0.0
  * @date    2015. 02. 03
  * @brief   LPC1768 Header 
  ******************************************************************************/


/*  GPIO SET / RESET */
#define OUTPUT 1
#define INPUT 0

/*  GPIO PORT */
#define GPIO_PORT_0				0		 	 //  Port P0 
#define GPIO_PORT_1				1		 	 //  Port P1 
#define GPIO_PORT_2				2 			 //  Port P2  
#define GPIO_PORT_3				3 			 //  Port P3  
#define GPIO_PORT_4				4 			 //  Port P4  


/*  GPIO PIN */
#define GPIO_PIN_0					0x00000001			// == (1) 					-> 0000	0000	0000	0000	0000	0000	0000	0001  -> 0╧Ь ги ╪╠ец
#define GPIO_PIN_1					0x00000002			// == (1 << 1)		-> 0000	0000	0000	0000	0000	0000	0000	0010  -> 1╧Ь ги ╪╠ец
#define GPIO_PIN_2					0x00000004			// == (1 << 2)		-> 0000	0000	0000	0000	0000	0000	0000	0100  -> 2╧Ь ги ╪╠ец
#define GPIO_PIN_3					0x00000008			// == (1 << 3)		-> 0000	0000	0000	0000	0000	0000	0000	1000  -> 3╧Ь ги ╪╠ец

#define GPIO_PIN_4					0x00000010			// == (1 << 4)		-> 0000	0000	0000	0000	0000	0000	0001	0000  -> 4╧Ь ги ╪╠ец
#define GPIO_PIN_5					0x00000020			// == (1 << 5)		-> 0000	0000	0000	0000	0000	0000	0010	0000  -> 5╧Ь ги ╪╠ец
#define GPIO_PIN_6					0x00000040			// == (1 << 6)		-> 0000	0000	0000	0000	0000	0000	0100	0000  -> 6╧Ь ги ╪╠ец
#define GPIO_PIN_7					0x00000080			// == (1 << 7)		-> 0000	0000	0000	0000	0000	0000	1000	0000  -> 7╧Ь ги ╪╠ец

#define GPIO_PIN_8					0x00000100			// == (1 << 8)		-> 0000	0000	0000	0000	0000	0001	0000	0000  -> 8╧Ь ги ╪╠ец
#define GPIO_PIN_9					0x00000200			// == (1 << 9)		-> 0000	0000	0000	0000	0000	0010	0000	0000  -> 9╧Ь ги ╪╠ец
#define GPIO_PIN_10				0x00000400			// == (1 << 10)	-> 0000	0000	0000	0000	0000	0100	0000	0000  -> 10╧Ь ги ╪╠ец
#define GPIO_PIN_11				0x00000800			// == (1 << 11)	-> 0000	0000	0000	0000	0000	1000	0000	0000  -> 11╧Ь ги ╪╠ец

#define GPIO_PIN_12				0x00001000			// == (1 << 12)	-> 0000	0000	0000	0000	0001	0000	0000	0000  -> 12╧Ь ги ╪╠ец
#define GPIO_PIN_13				0x00002000			// == (1 << 13)	-> 0000	0000	0000	0000	0010	0000	0000	0000  -> 13╧Ь ги ╪╠ец
#define GPIO_PIN_14				0x00004000			// == (1 << 14)	-> 0000	0000	0000	0000	0100	0000	0000	0000  -> 14╧Ь ги ╪╠ец
#define GPIO_PIN_15				0x00008000			// == (1 << 15)	-> 0000	0000	0000	0000	1000	0000	0000	0000  -> 15╧Ь ги ╪╠ец

#define GPIO_PIN_16				0x00010000			// == (1 << 16)	-> 0000	0000	0000	0001	0000	0000	0000	0000  -> 16╧Ь ги ╪╠ец
#define GPIO_PIN_17				0x00020000			// == (1 << 17)	-> 0000	0000	0000	0010	0000	0000	0000	0000  -> 17╧Ь ги ╪╠ец
#define GPIO_PIN_18				0x00040000			// == (1 << 18)	-> 0000	0000	0000	0100	0000	0000	0000	0000  -> 18╧Ь ги ╪╠ец
#define GPIO_PIN_19				0x00080000			// == (1 << 19)	-> 0000	0000	0000	1000	0000	0000	0000	0000  -> 19╧Ь ги ╪╠ец

#define GPIO_PIN_20				0x00100000			// == (1 << 20)	-> 0000	0000	0001	0000	0000	0000	0000	0000  -> 20╧Ь ги ╪╠ец
#define GPIO_PIN_21				0x00200000			// == (1 << 21)	-> 0000	0000	0010	0000	0000	0000	0000	0000  -> 21╧Ь ги ╪╠ец
#define GPIO_PIN_22				0x00400000			// == (1 << 22)	-> 0000	0000	0100	0000	0000	0000	0000	0000  -> 22╧Ь ги ╪╠ец
#define GPIO_PIN_23				0x00800000			// == (1 << 23)	-> 0000	0000	1000	0000	0000	0000	0000	0000  -> 23╧Ь ги ╪╠ец

#define GPIO_PIN_24				0x01000000			// == (1 << 24)	-> 0000	0001	0000	0000	0000	0000	0000	0000  -> 24╧Ь ги ╪╠ец
#define GPIO_PIN_25				0x02000000			// == (1 << 25)	-> 0000	0010	0000	0000	0000	0000	0000	0000  -> 25╧Ь ги ╪╠ец
#define GPIO_PIN_26				0x04000000			// == (1 << 26)	-> 0000	0100	0000	0000	0000	0000	0000	0000  -> 26╧Ь ги ╪╠ец
#define GPIO_PIN_27				0x08000000			// == (1 << 27)	-> 0000	1000	0000	0000	0000	0000	0000	0000  -> 27╧Ь ги ╪╠ец

#define GPIO_PIN_28				0x10000000			// == (1 << 28)	-> 0001	0000	0000	0000	0000	0000	0000	0000  -> 28╧Ь ги ╪╠ец
#define GPIO_PIN_29				0x20000000			// == (1 << 29)	-> 0010	0000	0000	0000	0000	0000	0000	0000  -> 29╧Ь ги ╪╠ец
#define GPIO_PIN_30				0x40000000			// == (1 << 30)	-> 0100	0000	0000	0000	0000	0000	0000	0000  -> 30╧Ь ги ╪╠ец
#define GPIO_PIN_31				0x80000000			// == (1 << 31)	-> 1000	0000	0000	0000	0000	0000	0000	0000  -> 31╧Ь ги ╪╠ец

/* LED */
#define LED1					1
#define LED2					2
#define LED3					3

#define LED4					4
#define LED5					5
#define LED6					6
#define LED7					7
#define LED8					8
#define LED_ALL		9




